--Заполнение данными таблицы клиенты
insert into tire.clients (first_name, midl_name, last_name, date_of_birth, phone_number)
values ('Иван', 'Иванович', 'Козлов', '1990-01-01', '+7 (953) 907-46-65'),
        ('Андрей', 'Артёмович', 'Иванов', '1975-11-03', '+7 (919) 406-49-93'),
        ('Николай', 'Миронович', 'Петров', '1995-03-01', '+7 (991) 275-97-35'),
        ('Антон', 'Владиславович', 'Осипов', '1989-05-03', '+7 (906) 252-75-88'),
        ('Александр', 'Романович', 'Смирнов', '1965-03-03', '+7 (980) 478-92-89'),
        ('Ибрагим', 'Кириллович', 'Соколов', '1983-01-01', '+7 (986) 486-94-41'),
        ('Кирилл', 'Петрович', 'Новиков', '1993-05-02', '+7 (910) 408-43-28'),
        ('Валера', 'Олегович', 'Михайлов', '1998-02-09', '+7 (996) 373-56-18'),
        ('Роман', 'Андреевич', 'Кузнецов', '1977-10-20', '+7 (906) 986-85-18'),
        ('Олег', 'Олегович', 'Жуков', '1986-08-15', '+7 (969) 312-35-29');

--Заполнение данными таблицы машины
insert into tire.cars (client_id, car_name, car_model, car_number)
values (1,'Toyota', 'Corolla', 'A143AJ'),
       (2,'Mercedes-Benz', 'C-Class', 'B222BB'),
       (3,'Daewoo', 'Chairman', 'B511AT'),
       (4,'Genesis', 'GV60', 'A152GA'),
       (5,'Aurus', 'Arsenal', 'F112AR'),
       (6,'Lada', 'Vesta', 'A731TA'),
       (7,'Chevrolet', 'Camaro', 'D191AA'),
       (8,'Acura', 'RSX', 'B118AA'),
       (9,'Chery', 'Arrizo 8', 'A611AA'),
       (10,'Geely', 'TUGELLA', 'A411QA'),
       (1,'SsangYong', 'Tivoli', 'A143AE'),
       (2,'Volkswagen', 'Golf GTI', 'A621AS');

--Заполнение данными таблицы для связи машины и клиента
insert into tire.clients_x_cars (car_id, client_id)
values (1,1),
       (2,2),
       (3,3),
       (4,4),
       (5,5),
       (6,6),
       (7,7),
       (8,8),
       (9,9),
       (10,10),
       (11,1),
       (12,2);

--Заполнение данными таблицы заказов
insert into tire.orders (car_id, cost_of_work)
values (1,1700),
       (2,2000),
       (3,9000),
       (5,8000),
       (6,7000),
       (12,6000),
       (4,5000),
       (11,4000),
       (7,3000),
       (9,2000);